{
  "id": "1752215827703-0y3j1vnfc",
  "name": "新建DOCX 文档.docx",
  "type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document",
  "size": 23648,
  "content": "1. 公司简介\n\n泰洛克斯（郑州）设备有限公司是一家集研发、生产、销售、服务和安装为一体的综合性机械设备企业。公司专业生产工业wood chipper 、Horizontal grinder、锯末粉碎机、生物质削片机、盘式削片机、鼓式削片机、木材回收设备的生产线有生物质颗粒机、有机肥生产线，木托盘生产线和连续切割的木工锯床生产线。\n\n作为一家拥有22年丰富经验的原始制造商，我们是中国唯一一家专注于木材削片机国际市场的公司。\n\n我们拥有强大的定制能力、售后支持、创新能力、丰富的发货经验和银行收款能力。\n\n我们拥有15个系列、50多种型号的木材粉碎设备，尤其是我们的欧式全液压卧式磨床，是中国第一台的标志型产品，以及用于生产颗粒、木炭和有机肥的生产线。只要是木材回收设备，我们都有信心为您提供高质量的设备。\n\n我们高度重视创新和技术进步，设立技术研发中心，掌握并拥有15项核心关键技术和自主知识产权，并不断引进国内外优秀技术人才，对产品进行研发和升级，更好地服务社会、服务客户。\n\n作为河南最大的削片机生产基地，我们拥有超过1500平方米的现货库存车间和4000平方的生产车间。年产700多台设备，对于库存充足的商品，交货通常需要5-10天。如果您需要定制设备，则需要20-30天。我们将尽一切努力尽快交货。\n\n所有出口设备均享有一年的售后保修，并为客户提供终身在线咨询和零件更换邮件服务。我们将以非常优惠的价格提供终身备件。\n\n我们的市场覆盖整个中东、欧洲和美洲，并出口到60多个国家。泰洛克斯机械的产品质量和新产品研发能力值得您的信赖。我们在全球有17个国家有代理商，可以提供本地化的服务，\n\n作为一家获得全球认可的制造商，我们持有ISO认证，确保产品质量始终如一，生产流程可持续。我们的设备已通过CE认证，符合欧盟安全标准，并拥有TUV认证，让您安心无忧地购买。此外，我们还通过UL和CSA认证，满足安全要求。1. Company Introduction\n\nTIROX (ZHENGZHOU) EQUIPMENT CO., LTD. is a comprehensive mechanical equipment enterprise \n\nintegrating R & D, production, sales, service and installation. It specializes in the production of branch crushers, sawdust crushers, biomass power plant preparation equipment, biomass pellet machines, gardens Branch treatment equipment, edible fungus preparation equipment, paper mill preparation equipment, related wood processing equipment etc.\n\nAs an original manufacturer with 22 years rich experience, we are the only company in China that focuses on the international market of wood chippers.\n\nWe have strong customization capabilities, after-sales support, innovation capabilities, rich shipment experience, and bank receipt capabilities.\n\nWe have 15 series and more than 50 models of wood crushing equipment, as well as production lines for making pellets, charcoal and organic fertilizer. As long as it is wood recycling equipment, we are confident to provide you with high-quality machine.\n\nWe attaches great importance to innovation and technological progress, establishes a technology research and development center, masters and owns a number of core key technologies and independent intellectual property rights, and constantly introduces domestic and foreign excellent technical personnel to research and develop and upgrade products to better serve the society and serve Customers.\n\nWe have a spot inventory workshop of over 1,500 square meters. For goods with sufficient inventory, delivery usually takes 5-10 days. If you need customized equipment, it will take 20-30 days. We will make every effort to deliver as soon as possible.\n\nAll exported machines come with a one-year warranty after sale, and we provide customers with lifelong online consultation and mail services for parts replacement. Lifelong spare parts will be offered at a very favorable price.\n\nOur market covers the entire Middle East, Europe and America, and we export to more than 60 countries. The product quality and new product R&D capabilities of Tirox Machinery are worthy of your trust.\n\nAs a globally accredited manufacturer, we hold ISO certifications, ensuring consistent product quality and sustainable production processes. Our equipment is CE-certified in compliance with EU safety standards, and TUV certification, giving you peace of mind in every purchase. And UL, CSA certification, to meets safety requirements. \n\n\n\n公司地址及网站\n\n地址：No. 6, Huangshan Road, Gongyi City,Zhengzhou City, Henan Province, China\n\n网址：https://www.zhangshengcorp.com\n\n\n\nCompany Address and Website\n\nAddress: No. 6, Huangshan Road, Gongyi City, Zhengzhou City, Henan Province, China\n\nWebsite: https://www.zhangshengcorp.com   https://www.tiroxcorp.com(之前这个没有显示）\n\n\n\n\n\n主营产品\n\nWood Chipper：\n\n5 inch Wood Chipper: As our best-selling machine, The Model ZSYL-600 Wood Chipper features large diameter drum rotors that can directly chop 5 inches wood or branches. The hydraulic feeding system reduces the return of materials, safely and effectively increases the feeding speed, and the output can reach 1000kg/hour.\n\nFeatures:\n\nWith hydraulic forced feeding system to assist feeding different material easily.\n\nWith smart feeding system, automatically monitor the work load of crushing mechanisms. When the load exceeds the alarm value, automatically reduce the feeding speed or stop feeding to avoid the stuck.\n\nEquipped with 360° adjustable chute, the wood chips can be sparyed into truck directly.\n\nEquipped with towing device, it can be easily towed by a small car.\n\nThe press roller has wave shape teeth, the loose branches are forced into the crushing chamber, making crushing easier and more efficient.\n\nEquipped with good Chinese local brand 35 HP, 1 cyl. diesel engine. We also support Cummins & Perkins brand diesel engine. EPA Tier 3 or tier 4 also available.\n\nBalancing the rotor, it can eliminate vibration hazards, ensure equipment stability, reduce energy consumption, improve operational efficiency, extend equipment lifespan, minimize maintenance costs, and lower operational risks.\n\nAccording to the different working condition and customer requirement, we can provide the wood chipper as mobile or stationary type or track type, powered by electricity or by diesel engine.\n\n\n\n6 inch Wood Chipper: As our best-selling machine, The Model ZSYL-800 Wood Chipper features large diameter drum rotors that can directly chop 6 inches wood or branches. The hydraulic feeding system reduces the return of materials, safely and effectively increases the feeding speed, and the output can reach 1500kg/hour;\n\nFeatures:\n\nWith hydraulic forced feeding system to assist feeding different material easily.\n\nWith smart feeding system, automatically monitor the work load of crushing mechanisms. When the load exceeds the alarm value, automatically reduce the feeding speed or stop feeding to avoid the stuck.\n\nEquipped with 360° adjustable chute, the wood chips can be sparyed into truck directly.\n\nEquipped with towing device, it can be easily towed by a small car.\n\nThe press roller has wave shape teeth, the loose branches are forced into the crushing chamber, making crushing easier and more efficient.\n\nEquipped with good Chinese local brand 54 HP, 4 cyl. diesel engine. We also support Cummins & Perkins brand diesel engine. EPA Tier 3 or tier 4 also available.\n\nBalancing the rotor, it can eliminate vibration hazards, ensure equipment stability, reduce energy consumption, improve operational efficiency, extend equipment lifespan, minimize maintenance costs, and lower operational risks.\n\nAccording to the different working condition and customer requirement, we can provide the wood chipper as mobile or stationary type or track type, powered by electricity or by diesel engine.\n\n\n\n12 inch Wood Chipper:As our best-selling machine, The Model ZSYL-1053 Wood Chipper can chop 10 inches wood or branches, the model ZSYL-1063 Wood Chipper can chop maximum diameter is 12 inches wood or branches. The model 1063 has a larger rotor diameter than the model 1053, making it easier to handle larger diameter wood. The model 1063 is popular with customers, the capacity is 6000kg/hour, higher than model 1053.\n\nFeatures:\n\nWith hydraulic forced feeding system, the feeding speed can be adjusted to meet the crushing of materials with different diameters. The higher the gear, the faster the speed and the higher the output.\n\nWith smart feeding system, automatically monitor the work load of crushing mechanisms. When the load exceeds the alarm value, automatically reduce the feeding speed or stop feeding to avoid the stuck.\n\nEquipped with 360° adjustable chute, discharging height and direction can be adjusted, so the wood chips can be sprayed into trucks easily.\n\nThe standard diesel engine configuration of model ZSYL-1063 is China Huadong brand 122 HP, 4 cyl. diesel engine, model ZSYL-1053 is China Huadong brand 102HP, 4 cyl. China Weichai, China Cummins and Perkins brand are also available. EPA Tier 3 or tier 4 also available.\n\nThe wood chipper has smart feeding system, automatically monitor the work load of crushing mechanisms. When the load exceeds the alarm value, automatically reduce the feeding speed or stop feeding to avoid the stuck.\n\nThrough the joysticks, you can manually control the press roll forward, backward and stop. If plugging occurs in the crushing work, the feed can be stopped at any time or spit/backward discharge, to ensure the safety of use.\n\nThe wood chipper can be connected with different tool vehicle according to the trailer valve. Equipped with off-road tires, which is durable and suitable for various road conditions.\n\nEmergency stop function included, safe to operate.\n\nThe press roller has wave shape teeth, the loose branches are forced into the crushing chamber, making crushing easier and more efficient.\n\nBalancing the rotor, it can eliminate vibration hazards, ensure equipment stability, reduce energy consumption, improve operational efficiency, extend equipment lifespan, minimize maintenance costs, and lower operational risks.\n\nAccording to the different working condition and customer requirement, we can provide the wood chipper as mobile or stationary type or track type, powered by electricity or by diesel engine.\n\nProvide professional solutions based on customer needs and support special customization.\n\n\n\n14 inch Wood Chipper: As our best-selling machine, The Model ZSYL-1263 Wood Chipper features large diameter drum rotors that can directly chop 14 inches wood or branches, and the output can reach 7000kg/hour;\n\nFeatures:\n\nWith hydraulic forced feeding system, the feeding speed can be adjusted to meet the crushing of materials with different diameters. The higher the gear, the faster the speed and the higher the output.\n\nWith smart feeding system, automatically monitor the work load of crushing mechanisms. When the load exceeds the alarm value, automatically reduce the feeding speed or stop feeding to avoid the stuck.\n\nEquipped with 360° adjustable chute, discharging height and direction can be adjusted, so the wood chips can be sprayed into trucks easily.\n\nThe standard diesel engine configuration is China Huadong brand 197 HP, 6 cyl. diesel engine. China Weichai, China Cummins and Perkins brand are also available. EPA Tier 3 or tier 4 also available.\n\nThe wood chipper has smart feeding system, automatically monitor the work load of crushing mechanisms. When the load exceeds the alarm value, automatically reduce the feeding speed or stop feeding to avoid the stuck.\n\nThrough the joysticks, you can manually control the press roll forward, backward and stop. If plugging occurs in the crushing work, the feed can be stopped at any time or spit/backward discharge, to ensure the safety of use.\n\nThe wood chipper can be connected with different tool vehicle according to the trailer valve. Equipped with off-road tires, which is durable and suitable for various road conditions.\n\nEmergency stop function included, safe to operate.\n\nThe press roller has wave shape teeth, the loose branches are forced into the crushing chamber, making crushing easier and more efficient.\n\nBalancing the rotor, it can eliminate vibration hazards, ensure equipment stability, reduce energy consumption, improve operational efficiency, extend equipment lifespan, minimize maintenance costs, and lower operational risks.\n\nAccording to the different working condition and customer requirement, we can provide the wood chipper as mobile or stationary type or track type, powered by electricity or by diesel engine.\n\nProvide professional solutions based on customer needs and support special customization.\n\n\n\n19 inch Wood Chipper: As our best-selling machine, The Model ZSYL-1585/1585X Chipper features large diameter drum rotors that can directly chop wood of 19 inches, and the output can reach 7000-10000 kg/hour;\n\nFeatures:\n\nWith hydraulic forced feeding system, the feeding speed can be adjusted to meet the crushing of materials with different diameters. The higher the gear, the faster the speed and the higher the output.\n\nWith smart feeding system, automatically monitor the work load of crushing mechanisms. When the load exceeds the alarm value, automatically reduce the feeding speed or stop feeding to avoid the stuck.\n\nEquipped with 360° adjustable chute, discharging height and direction can be adjusted, so the wood chips can be sprayed into trucks easily.\n\nThe standard diesel engine configuration is China Huadong brand 235/336 HP, 6 cyl. diesel engine. China Weichai, China Cummins and Perkins brand are also available. EPA Tier 3 or tier 4 also available.\n\nThe wood chipper has smart feeding system, automatically monitor the work load of crushing mechanisms. When the load exceeds the alarm value, automatically reduce the feeding speed or stop feeding to avoid the stuck.\n\nThrough the joysticks, you can manually control the press roll forward, backward and stop. If plugging occurs in the crushing work, the feed can be stopped at any time or spit/backward discharge, to ensure the safety of use.\n\nThe wood chipper can be connected with different tool vehicle according to the trailer valve. Equipped with off-road tires, which is durable and suitable for various road conditions.\n\nEmergency stop function included, safe to operate.\n\nThe press roller has wave shape teeth, the loose branches are forced into the crushing chamber, making crushing easier and more efficient.\n\nEquipped with the intelligent control panel, can displays the woking conditions (oil volume, water temperature, working hours, etc.) in time to find abnormalities and reduce maintenance. Reliable and convenient starting at the turn of a key.\n\nThe chain plate is individually controlled by an intelligent hydraulic system that can go forward, back and stop at any time. The chain plate adopts Q235 carbon steel plate, which has large conveying capacity and large load bearing capacity.\n\nOptional log grabbing machine, which can be used in conjunction with the intelligent feeding system and metal conveyor equipped for an even feeding.\n\nBalancing the rotor, it can eliminate vibration hazards, ensure equipment stability, reduce energy consumption, improve operational efficiency, extend equipment lifespan, minimize maintenance costs, and lower operational risks.\n\nAccording to the different working condition and customer requirement, we can provide the wood chipper as mobile or stationary type or track type, powered by electricity or by diesel engine.\n\nProvide professional solutions based on customer needs and support special customization.\n\n\n\nWood Crusher：The wood crusher, also known as the wood sawdust machine, integrates slicing and crushing. It can cut branches and logs with a chip diameter of 1 to 45 cm. It can also be used to crush fibrous stalk-like materials such as bamboo, thatch, corn stalks, and sorghum stalks. Processed wood chips can be used to make pellets, charcoal, edible fungus cultivation, particleboard, compost, etc. This machine has a wide range of uses, low price, and very stable quality, so it sells very well in the foreign trade market.\n\nFeatures:\n\nThe cutter head is made of high manganese steel for continuous high-strength operation, which can also ensure that the cutter head is not easily deformed.\n\nAfter the blade is cut, the wood is impacted by a high-speed rotating hammer. The hammer can be used on both sides, reducing parts replacement.\n\nThe output sawdust size can be controlled by the sieve in the crusher.\n\nBalancing the rotor, it can eliminate vibration hazards, ensure equipment stability, reduce energy consumption, improve operational efficiency, extend equipment lifespan, minimize maintenance costs, and lower operational risks.\n\nFor small model, double inlets or single inlet as option. The A feeding inlet can crush wood easily, such as logs, plates, bamboos, etc. The B feeding inlet is more friendly to branches, straw, corncob and other crop branches.\n\nAccording to the different working condition and customer requirement, we can provide the wood crusher as mobile or stationary type, powered by electricity or by diesel engine.\n\nProvide professional solutions based on customer needs and support special customization.\n\n\n\nHorizontal Grinder: \n\nThe horizontal grinder can effectively process different raw materials such as logs, whole trees, bark, slabs, air-dried or kiln-dried wood, pallet waste, asphalt felt, clothing, plastic steel, plastic bags, etc. Depending on the size of the raw material to be crushed and different production requirements, the machine can be equipped with engines from 240 to 1200 hp. It can also provide you with suitable solutions for tire or track mobility depending on the characteristics of the site.\n\nThe horizontal chipper is suitable for large-scale wood chipping. This series is suitable for a variety of materials: from bush and small materials to logs with a diameter of up to 32 inches (80 cm). The size of the chipped wood varies from 10 cm to less than 1 cm. The maximum capacity can reach about 60 tons. \n\nFor different budgets and requirements, we can provide three different types of horizontal grinders. You can find the right configuration, allows you to maximize the value of your investment.\n\n\n\nThe 1st generation-traditional type light duty horizontal grinder. \n\nSuitable for light duty application. working time around 4-6 hours per day. Lower capacity requirement.\n\nFeatures:\n\nBest money performance.\n\nThe output size can be controlled by the sieve in the machine.\n\nAccording to the different working condition and customer requirement, we can provide the horizontal grinder as mobile or stationary type or track type, powered by electricity or by diesel engine.\n\nEquipped with metal plate feeding conveyor, the chain plate adopts Q235 carbon steel plate, which has large conveying capacity and large load bearing capacity, more durable to use.\n\nThe horizontal grinder has intelligent feeding system. Automatically monitor the work load of crushing mechanisms. When the load exceeds the alarm value, automatically reduce the feeding speed or stop feeding to avoid the stuck.\n\nWith remote control, the operator can remotely control the grinder, which is very safe and convenient.\n\nOptional iron removal system, the horizontal grinder can be equipped with an iron remover and a dry magnetic roller to effectively remove iron and meet customer needs.\n\nTo meet different needs, professional technicians specialize in customizing different types of rotors and provide professional solutions.\n\nCustomized service. As a original factory, Tirox machinery has professional technical and production team to supply customized service, such as adding winch, grabber, crane, and racked moved.\n\nEquipped with good Chinese local brand Weichai diesel engine. We also support Cummins & Perkins brand diesel engine to get higher working performance.\n\nHydraulic Feeding System. According to the size of the wood, the hydraulic system automatically lifts the pressure roller, increases the crushing area and the production capacity.\n\nThe discharging conveyor is foldable and output can be fed directly into the truck.\n\n\n\nThe 2nd generation-Traditional type heavy duty horizontal grinder. \n\nAs the type for heavy duty wood working application. It can do continuous work thanks to the autolubrication system, stronger body structure, bigger crushing rotor and good bearings, bolts and parts adapted.\n\nFeatures:\n\nThe output size can be controlled by the sieve in the machine.\n\nAccording to the different working condition and customer requirement, we can provide the horizontal grinder as mobile or stationary type or track type, powered by electricity or by diesel engine. The first Chinese manufacturer to produce tracked horizontal grinders started its production in 2017. The first Chinese manufacturer to produce fully hydraulic tracked horizontal grinders initiated production in 2018.\n\nEquipped with metal plate feeding conveyor, the chain plate adopts Q235 carbon steel plate, which has large conveying capacity and large load bearing capacity, more durable to use.\n\nThe horizontal grinder has intelligent feeding system. Automatically monitor the work load of crushing mechanisms. When the load exceeds the alarm value, automatically reduce the feeding speed or stop feeding to avoid the stuck.\n\nWith remote control, the operator can remotely control the grinder, which is very safe and convenient.\n\nOptional iron removal system, the horizontal grinder can be equipped with an iron remover and a dry magnetic roller to effectively remove iron and meet customer needs.\n\nTo meet different needs, professional technicians specialize in customizing different types of rotors and provide professional solutions.\n\nCustomized service. As a original factory, Tirox machinery has professional technical and production team to supply customized service, such as adding winch, grabber, crane, and racked moved.\n\nEquipped with good Chinese local brand Weichai diesel engine. We also support Cummins & Perkins brand diesel engine to get higher working performance.\n\nHydraulic Feeding System. According to the size of the wood, the hydraulic system automatically lifts the pressure roller, increases the crushing area and the production capacity.\n\nThe discharging conveyor is foldable and output can be fed directly into the truck.\n\nWith automatic lubrication system. The operators do not have to pay attention to the lubrication procedures at all times, reducing the rate of operating errors and machine failure.\n\nWith quick rotor replacement function, and  can quickly replace the blade h or hammer and screen. It is simple and convenient to operate and easy to maintain.\n\nWith A8B tool steel blades material, can easily handle a variety of materials.\n\nWhen the machine is jammed, the metal chain conveyor, pressure roller rotate in opposite directions at the same time to discharge the jammed materials. \n\nWith inverter. The feeding conveying speed and rotation speed can be adjusted according to needs, which is convenient for operation.\n\nOverload protection optional. Overload protection for V-belt and Diesel engine, protect the machine during operating.\n\nData visualization. The intelligent control panel displays the working conditions (oil volume, water temperature, working hours, etc.) in time to find abnormalities and reduce maintenance. Reliable and convenient starting at the turn of a key.\n\nThickened steel plate. The steel plate of the machine is thickened, work more stably.\n\nCompact machine structure. The grinder has compact structure, very reliable and durable.\n\n\n\nThe 3rd generation-New American type design, heavy duty horizontal grinder. \n\nCustomers use this type as Vermeer and CBI horizontal grinder's Replacement.\n\nThe optimized hydraulic design provides more reliable power for the machine's operation, and the energy efficiency utilization rate is increased by 20%. \n\nFeatures:\n\nThe output size can be controlled by the sieve in the machine.\n\nAccording to the different working condition and customer requirement, we can provide the horizontal grinder as mobile or stationary type or track type, powered by electricity or by diesel engine. The first Chinese manufacturer to produce tracked horizontal grinders started its production in 2017. The first Chinese manufacturer to produce fully hydraulic tracked horizontal grinders initiated production in 2018.\n\nEquipped with metal plate feeding conveyor, the chain plate adopts Q235 carbon steel plate, which has large conveying capacity and large load bearing capacity, more durable to use.\n\nThe horizontal grinder has intelligent feeding system. Automatically monitor the work load of crushing mechanisms. When the load exceeds the alarm value, automatically reduce the feeding speed or stop feeding to avoid the stuck.\n\nWith remote control, the operator can remotely control the grinder, which is very safe and convenient.\n\nOptional iron removal system, the horizontal grinder can be equipped with an iron remover and a dry magnetic roller to effectively remove iron and meet customer needs.\n\nTo meet different needs, professional technicians specialize in customizing different types of rotors and provide professional solutions.\n\nCustomized service. As a original factory, Tirox machinery has professional technical and production team to supply customized service, such as adding winch, grabber, crane, and racked moved.\n\nEquipped with good Chinese local brand Weichai diesel engine. We also support Cummins & Perkins brand diesel engine to get higher working performance.\n\nHydraulic Feeding System. According to the size of the wood, the hydraulic system automatically lifts the pressure roller, increases the crushing area and the production capacity.\n\nThe discharging conveyor is foldable and output can be fed directly into the truck.\n\nWith automatic lubrication system. The operators do not have to pay attention to the lubrication procedures at all times, reducing the rate of operating errors and machine failure.\n\nWith quick rotor replacement function, and  can quickly replace the blade h or hammer and screen. It is simple and convenient to operate and easy to maintain.\n\nWith A8B tool steel blades material, can easily handle a variety of materials.\n\nWhen the machine is jammed, the metal chain conveyor, pressure roller rotate in opposite directions at the same time to discharge the jammed materials. \n\nWith inverter. The feeding conveying speed and rotation speed can be adjusted according to needs, which is convenient for operation.\n\nOverload protection optional. Overload protection for V-belt and Diesel engine, protect the machine during operating.\n\nData visualization. The intelligent control panel displays the working conditions (oil volume, water temperature, working hours, etc.) in time to find abnormalities and reduce maintenance. Reliable and convenient starting at the turn of a key.\n\nThickened steel plate. The steel plate of the machine is thickened, work more stably.\n\nCompact machine structure. The grinder has compact structure, very reliable and durable.",
  "uploadTime": "2025-07-11T06:37:07.807Z",
  "path": "1752215827703-0y3j1vnfc-新建DOCX 文档.docx"
}